"""add test data

Revision ID: 0f87162cdc37
Revises: 891af7e18832
Create Date: 2025-11-07 15:45:47.141585

"""
from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa

# revision identifiers, used by Alembic.
revision: str = '0f87162cdc37'
down_revision: Union[str, Sequence[str], None] = '891af7e18832'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:
    connection = op.get_bind()

    # Вставляем activities (id - Integer)
    connection.execute(
        sa.text(
            """
            INSERT INTO activities (id, name, parent_id)
            VALUES (1, 'Еда', NULL),
                   (2, 'Мясная продукция', 1),
                   (3, 'Колбасы', 2),
                   (4, 'Молочная продукция', 1),
                   (5, 'Сыры', 4),
                   (6, 'Развлечения', NULL),
                   (7, 'Кино', 6),
                   (8, 'Бары', 6),
                   (9, 'Рестораны', 1),
                   (10, 'Итальянская кухня', 9),
                   (11, 'Японская кухня', 9),
                   (12, 'Спорт', NULL),
                   (13, 'Фитнес-клубы', 12),
                   (14, 'Бассейны', 12),
                   (15, 'Торговля', NULL),
                   (16, 'Одежда', 15),
                   (17, 'Обувь', 15),
                   (18, 'Электроника', 15);
            """
        )
    )

    # Вставляем buildings (id - String UUID)
    connection.execute(
        sa.text(
            """
            INSERT INTO buildings (id, address, latitude, longitude, geom)
            VALUES ('8f36005c-dce1-4e35-9cef-3c96534300f2', 'ул. Ленина, 1', 55.7558, 37.6176, ST_GeomFromText('POINT(37.6176 55.7558)', 4326)),
                   ('dc091968-f6e5-43c5-8112-9180dcfc3c67', 'ул. Пушкина, 10', 55.7517, 37.6178, ST_GeomFromText('POINT(37.6178 55.7517)', 4326)),
                   ('df46a7d5-3eeb-4989-b43f-78a3a0c14c8e', 'Невский проспект, 5', 59.9343, 30.3351, ST_GeomFromText('POINT(30.3351 59.9343)', 4326)),
                   ('fed7db58-67cf-40cc-9405-46c46b27e8bf', 'ул. Тверская, 15', 55.7558, 37.6173, ST_GeomFromText('POINT(37.6173 55.7558)', 4326)),
                   ('87217667-b765-4522-8c21-d38caf09d3de', 'пр. Мира, 20', 55.7934, 37.6255, ST_GeomFromText('POINT(37.6255 55.7934)', 4326)),
                   ('bcb41078-da0b-48b3-a0a8-f9d721cf9486', 'ул. Арбат, 25', 55.7520, 37.5914, ST_GeomFromText('POINT(37.5914 55.7520)', 4326)),
                   ('6530122d-96f7-42ca-86a0-f701a4af9dcf', 'Ленинградский проспект, 30', 55.7896, 37.5448, ST_GeomFromText('POINT(37.5448 55.7896)', 4326)),
                   ('70c0dd20-5528-4996-8097-aca843bdcfb1', 'ул. Садовая, 12', 59.9343, 30.3351, ST_GeomFromText('POINT(30.3351 59.9343)', 4326)),
                   ('4ee416b3-963b-4736-9060-0b0344c91508', 'пр. Невский, 50', 59.9343, 30.3351, ST_GeomFromText('POINT(30.3351 59.9343)', 4326)),
                   ('e45d07e5-610d-4e12-b7cb-b9e1321b3362', 'ул. Красная площадь, 1', 55.7539, 37.6208, ST_GeomFromText('POINT(37.6208 55.7539)', 4326));
            """
        )
    )

    # Вставляем organizations (id - String UUID)
    connection.execute(
        sa.text(
            """
            INSERT INTO organizations (id, title, building_id)
            VALUES ('6104d295-ec06-4dff-bb9f-38216258a764', 'Мясной дом', '8f36005c-dce1-4e35-9cef-3c96534300f2'),
                   ('71b89dfd-eb95-456d-98c3-3c2707d9d197', 'Сырная лавка', '8f36005c-dce1-4e35-9cef-3c96534300f2'),
                   ('d19368e4-e994-4501-b753-9bce0c4069e0', 'Бар "Кружка"', 'dc091968-f6e5-43c5-8112-9180dcfc3c67'),
                   ('07a9f6ef-a12c-4ce3-a670-0c4c931925a3', 'Кинотеатр "Луч"', 'df46a7d5-3eeb-4989-b43f-78a3a0c14c8e'),
                   ('4bf5d006-56c2-4d5d-9732-19e08390cfc2', 'Ресторан "Италия"', 'fed7db58-67cf-40cc-9405-46c46b27e8bf'),
                   ('9a0ddb7e-7353-45e1-be5d-cc3de42d1342', 'Суши-бар "Токио"', '87217667-b765-4522-8c21-d38caf09d3de'),
                   ('8c3d58b2-14d3-4549-87e1-f371bb42924d', 'Фитнес-клуб "Сила"', 'bcb41078-da0b-48b3-a0a8-f9d721cf9486'),
                   ('5086e210-2eb9-42a6-88ae-c2b7a34af0b1', 'Бассейн "Волна"', '6530122d-96f7-42ca-86a0-f701a4af9dcf'),
                   ('f3d8116e-6c78-47ae-989a-a2f8f49b0ca4', 'Магазин одежды "Стиль"', '70c0dd20-5528-4996-8097-aca843bdcfb1'),
                   ('efc2a0d2-8d20-45e0-bcf1-177c94fb809c', 'Обувной магазин "Комфорт"', '4ee416b3-963b-4736-9060-0b0344c91508'),
                   ('ccb1dd73-f730-4038-ab0c-cd09ed9a257c', 'Магазин электроники "Техно"', 'e45d07e5-610d-4e12-b7cb-b9e1321b3362'),
                   ('b645850d-760d-4a4b-8e01-48cadd1a2d7f', 'Ресторан "Париж"', 'fed7db58-67cf-40cc-9405-46c46b27e8bf'),
                   ('6ad789cd-248a-4ef7-bc18-f347ee532132', 'Кинотеатр "Звезда"', 'df46a7d5-3eeb-4989-b43f-78a3a0c14c8e'),
                   ('c62dcd75-b98d-4d69-a58c-811a62e1dcef', 'Бар "Рок"', 'dc091968-f6e5-43c5-8112-9180dcfc3c67'),
                   ('eee23a28-b406-41d7-942b-f295177af149', 'Спорт-бар "Чемпион"', '87217667-b765-4522-8c21-d38caf09d3de');
            """
        )
    )

    # Вставляем organization_phones (id - String UUID)
    connection.execute(
        sa.text(
            """
            INSERT INTO organization_phones (id, organization_id, phone_number)
            VALUES ('31b99416-296c-440f-8713-9144e672f66f', '6104d295-ec06-4dff-bb9f-38216258a764', '+7-999-111-22-33'),
                   ('a734b789-72e8-46c2-b43a-a980708688bf', '71b89dfd-eb95-456d-98c3-3c2707d9d197', '+7-999-111-44-55'),
                   ('e291957a-c255-4880-99cc-c923e8ce07a4', 'd19368e4-e994-4501-b753-9bce0c4069e0', '+7-999-222-11-22'),
                   ('bf28be60-3925-4516-b3d0-4da81bf30b0a', 'd19368e4-e994-4501-b753-9bce0c4069e0', '+7-999-222-11-42'),
                   ('4a74df91-0d9a-4e15-b094-9d6f8e0f6b61', '07a9f6ef-a12c-4ce3-a670-0c4c931925a3', '+7-999-555-77-88'),
                   ('1750a9e5-d9d7-459d-a779-a3b59de3cd0f', '4bf5d006-56c2-4d5d-9732-19e08390cfc2', '+7-999-333-44-55'),
                   ('2cf956f5-e650-4817-a6c2-895b288bd322', '4bf5d006-56c2-4d5d-9732-19e08390cfc2', '+7-999-333-44-66'),
                   ('2495a9f8-566e-4d37-94d4-db6badb2a836', '9a0ddb7e-7353-45e1-be5d-cc3de42d1342', '+7-999-444-55-66'),
                   ('8937b827-ef38-4f3c-a48c-4231437c40df', '8c3d58b2-14d3-4549-87e1-f371bb42924d', '+7-999-555-66-77'),
                   ('4b930e79-8d3f-4f34-80b2-b1c386266aca', '5086e210-2eb9-42a6-88ae-c2b7a34af0b1', '+7-999-666-77-88'),
                   ('4630e872-acb8-4b07-a210-9e47b3457728', 'f3d8116e-6c78-47ae-989a-a2f8f49b0ca4', '+7-999-777-88-99'),
                   ('2b9993bc-d4e8-411a-a30b-acdb82803c99', 'efc2a0d2-8d20-45e0-bcf1-177c94fb809c', '+7-999-888-99-00'),
                   ('fb07f8b3-3133-47dd-bd3c-28634c0abb8e', 'ccb1dd73-f730-4038-ab0c-cd09ed9a257c', '+7-999-000-11-22'),
                   ('bc3e3414-890b-49ae-a5f2-59ea5ed19b59', 'b645850d-760d-4a4b-8e01-48cadd1a2d7f', '+7-999-111-22-44'),
                   ('9f009f6c-58f0-421e-967c-3c46570f41c0', '6ad789cd-248a-4ef7-bc18-f347ee532132', '+7-999-222-33-44'),
                   ('75792829-b257-4b36-9abc-b93cde3702f6', 'c62dcd75-b98d-4d69-a58c-811a62e1dcef', '+7-999-333-44-55'),
                   ('03e8ae08-51a5-4d45-ad42-c832e0d2fafc', 'eee23a28-b406-41d7-942b-f295177af149', '+7-999-444-55-66');
            """
        )
    )

    # Вставляем organization_activities
    connection.execute(
        sa.text(
            """
            INSERT INTO organization_activities (organization_id, activity_id)
            VALUES ('6104d295-ec06-4dff-bb9f-38216258a764', 1), -- Мясной дом → Еда
                   ('6104d295-ec06-4dff-bb9f-38216258a764', 2), -- Мясной дом → Мясная продукция
                   ('6104d295-ec06-4dff-bb9f-38216258a764', 3), -- Мясной дом → Колбасы
                   ('71b89dfd-eb95-456d-98c3-3c2707d9d197', 1), -- Сырная лавка → Еда
                   ('71b89dfd-eb95-456d-98c3-3c2707d9d197', 4), -- Сырная лавка → Молочная продукция
                   ('71b89dfd-eb95-456d-98c3-3c2707d9d197', 5), -- Сырная лавка → Сыры
                   ('d19368e4-e994-4501-b753-9bce0c4069e0', 6), -- Бар "Кружка" → Развлечения
                   ('d19368e4-e994-4501-b753-9bce0c4069e0', 8), -- Бар "Кружка" → Бары
                   ('07a9f6ef-a12c-4ce3-a670-0c4c931925a3', 6), -- Кинотеатр "Луч" → Развлечения
                   ('07a9f6ef-a12c-4ce3-a670-0c4c931925a3', 7), -- Кинотеатр "Луч" → Кино
                   ('4bf5d006-56c2-4d5d-9732-19e08390cfc2', 1), -- Ресторан "Италия" → Еда
                   ('4bf5d006-56c2-4d5d-9732-19e08390cfc2', 9), -- Ресторан "Италия" → Рестораны
                   ('4bf5d006-56c2-4d5d-9732-19e08390cfc2', 10), -- Ресторан "Италия" → Итальянская кухня
                   ('9a0ddb7e-7353-45e1-be5d-cc3de42d1342', 1), -- Суши-бар "Токио" → Еда
                   ('9a0ddb7e-7353-45e1-be5d-cc3de42d1342', 9), -- Суши-бар "Токио" → Рестораны
                   ('9a0ddb7e-7353-45e1-be5d-cc3de42d1342', 11), -- Суши-бар "Токио" → Японская кухня
                   ('8c3d58b2-14d3-4549-87e1-f371bb42924d', 12), -- Фитнес-клуб "Сила" → Спорт
                   ('8c3d58b2-14d3-4549-87e1-f371bb42924d', 13), -- Фитнес-клуб "Сила" → Фитнес-клубы
                   ('5086e210-2eb9-42a6-88ae-c2b7a34af0b1', 12), -- Бассейн "Волна" → Спорт
                   ('5086e210-2eb9-42a6-88ae-c2b7a34af0b1', 14), -- Бассейн "Волна" → Бассейны
                   ('f3d8116e-6c78-47ae-989a-a2f8f49b0ca4', 15), -- Магазин одежды "Стиль" → Торговля
                   ('f3d8116e-6c78-47ae-989a-a2f8f49b0ca4', 16), -- Магазин одежды "Стиль" → Одежда
                   ('efc2a0d2-8d20-45e0-bcf1-177c94fb809c', 15), -- Обувной магазин "Комфорт" → Торговля
                   ('efc2a0d2-8d20-45e0-bcf1-177c94fb809c', 17), -- Обувной магазин "Комфорт" → Обувь
                   ('ccb1dd73-f730-4038-ab0c-cd09ed9a257c', 15), -- Магазин электроники "Техно" → Торговля
                   ('ccb1dd73-f730-4038-ab0c-cd09ed9a257c', 18), -- Магазин электроники "Техно" → Электроника
                   ('b645850d-760d-4a4b-8e01-48cadd1a2d7f', 1), -- Ресторан "Париж" → Еда
                   ('b645850d-760d-4a4b-8e01-48cadd1a2d7f', 9), -- Ресторан "Париж" → Рестораны
                   ('6ad789cd-248a-4ef7-bc18-f347ee532132', 6), -- Кинотеатр "Звезда" → Развлечения
                   ('6ad789cd-248a-4ef7-bc18-f347ee532132', 7), -- Кинотеатр "Звезда" → Кино
                   ('c62dcd75-b98d-4d69-a58c-811a62e1dcef', 6), -- Бар "Рок" → Развлечения
                   ('c62dcd75-b98d-4d69-a58c-811a62e1dcef', 8), -- Бар "Рок" → Бары
                   ('eee23a28-b406-41d7-942b-f295177af149', 6), -- Спорт-бар "Чемпион" → Развлечения
                   ('eee23a28-b406-41d7-942b-f295177af149', 8), -- Спорт-бар "Чемпион" → Бары
                   ('eee23a28-b406-41d7-942b-f295177af149', 12); -- Спорт-бар "Чемпион" → Спорт
            """
        )
    )


def downgrade() -> None:
    connection = op.get_bind()
    connection.execute(sa.text("DELETE FROM organization_activities;"))
    connection.execute(sa.text("DELETE FROM organization_phones;"))
    connection.execute(sa.text("DELETE FROM organizations;"))
    connection.execute(sa.text("DELETE FROM buildings;"))
    connection.execute(sa.text("DELETE FROM activities;"))
